juugokaime/app/controllers/tasks_controller.rb

  def edit
    # @task = Task.find(params[:id])
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    # task = Task.find(params[:id])
    @task = current_user.tasks.find(params[:id])
    task.name = params["tasks"]["name"]
    task.description = params["tasks"]["description"]
    task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "addあ"], ["description", "ggggあ"], ["updated_at", "2020-01-18 14:41:21.215298"], ["id", 2]]

   task = Task.new(task_params)
   task.save!
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "山田"], ["description", "ここに説明書く"], ["created_at", "2020-01-18 16:05:49.253853"], ["updated_at", "2020-01-18 16:05:49.253853"]]